---
kind: property
id: P:Autodesk.Revit.DB.Visual.SolidGlass.SolidglassTransmittance
source: html/2ca23814-372b-65d3-017a-e39c8ce50770.htm
---
# Autodesk.Revit.DB.Visual.SolidGlass.SolidglassTransmittance Property

The property labeled "Color" from the "SolidGlass" schema.

## Syntax (C#)
```csharp
public static string SolidglassTransmittance { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SolidglassTransmittanceType".